'use strict';

function ipToInt(ip = '127.0.0.1') {     // Створення функції, у якої аргумент ip за замовчуванням = '127.0.0.1'
  const octets = ip.split('.');     // Розбиваємо рядок ip на масив октетів ['октет1', 'октет2', 'октет3', 'октет4']
  function shiftAdd(acc, octet) {   // Функція-правило для reduce: acc — те, що вже накопичили на попередніх кроках, octet — поточний елемент масиву (один октет)
    return (acc << 8) + parseInt(octet, 10);    //Зсуваємо накопичене на 8 біт вліво (множимо на 256) і додаємо новий октет, перетворений у число через parseInt
  }
  return octets.reduce(shiftAdd, 0);   // Запускаємо reduce над масивом октетів: shiftAdd — функція-правило, 0 — стартове значення накопичувача
}                                      // reduce сам пройде по масиву, сам викличе shiftAdd для кожного октету, сам оновить накопичувач і поверне фінальне число

console.log(ipToInt());
console.log(ipToInt('10.0.0.1'));






// Детальніше про reduce у цьому коді:

// reduce отримує: функцію-правило shiftAdd та початкове значення накопичувача 0
// Далі reduce виконує свій алгоритм:
// Створює власну внутрішню змінну-накопичувач і записує туди 0
// 1) Проходить по масиву octets зліва направо
// 2) На кожному елементі:
//    а) бере поточний елемент масиву;
//    б) викликає shiftAdd(накопичувач, поточний_елемент);
//    в) результат виклику записує назад у накопичувач.
//    г) після обробки останнього елемента reduce повертає підсумкове значення свого накопичувача
//      (тобто фінальне число, яке вийшло в результаті проходу по всьому масиву)




//Покрокове виконання для '10.0.0.1':

// Масив: octets = ['10', '0', '0', '1']. Початковий накопичувач: 0.

// Ітерація 1 (індекс 0):
// 1) reduce викликає shiftAdd(0, '10')
// 2) у shiftAdd: acc = 0, octet = '10'
// 3) тіло функції shiftAdd: (0 << 8) + parseInt('10', 10) = 0 + 10 = 10
// 4) reduce записує в накопичувач 10

// Ітерація 2 (індекс 1):
// 1) reduce викликає shiftAdd(10, '0');
// 2) у shiftAdd: acc = 10, octet = '0';
// 3) тіло функції shiftAdd: (10 << 8) + parseInt('0', 10) = 2560 + 0 = 2560;
// 4) reduce записує в накопичувач 2560.

// Ітерація 3 (індекс 2):
// 1) reduce викликає shiftAdd(2560, '0');
// 2) у shiftAdd: acc = 2560, octet = '0';
// 3) тіло функції shiftAdd: (2560 << 8) + parseInt('0', 10) = 655360 + 0 = 655360;
// 4) reduce записує в накопичувач 655360.

// Ітерація 4 (індекс 3):
// 1) reduce викликає shiftAdd(655360, '1');
// 2) у shiftAdd: acc = 655360, octet = '1';
// 3) тіло функції shiftAdd: (655360 << 8) + parseInt('1', 10) = 167772160 + 1 = 167772161;
// 4) reduce записує в накопичувач 167772161.

// Масив закінчився — reduce повертає 167772161.

