'use strict';

// Перша реалізація функції inc
function inc(n) {    // Функція риймає число n
  return ++n;    // і повертає його ж, збільшене на 1
}

const a = 5;
const b = inc(a);

console.dir({a, b});    // Виведе {a: 5, b: 6} (a не змінилось, оскільки передається у функцію як копія; b отримало значення 6 з return)



// Друга реалізація функції inc

function incObj(num) {   // Функція приймає об'єкт
  num.n++;   // та збільшує властивість n цього об'єкта на 1
}

const obj = {n: 5};
incObj(obj);

console.dir(obj);    // Виведе {n: 6}, ми змінили властивість n об'єкта obj з 5 на 6